# Origin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Line..::..Origin Property
Line Class See Also
---
Returns the origin of the line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Origin { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Origin As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Origin {
	XYZ^ get ();
}
```

# See Also
Line Class
Autodesk.Revit.DB Namespace